package main

import (
	"fmt"
)

func main() {
	//int&uint&uintptr类型的长度由运行所在的操作系统决定
	//int&uint在32位系统中位4字节,64位系统中为8字节
	//uintptr长度被设定为足够存放一个指针
	//整数
	var i1 int8=126//-128~127
	var i2 int16=32766//-32768~32767
	var i3 int32=2147483646//-2147483648~2147483647
	var i4 int64=9223372036854775807//-9223372036854775808~9223372036854775807
	//无符号整数
	var ui1 int8=255//0~255
	var ui2 int16=65535//0~65535
	var ui3 int32=4294967295//0~4294967295
	var ui4 int64=18446744073709551615//0~18446744073709551615
	//浮点型
	var f1 float32=3.4e38//1e-45~3.4e38
	var f2 float64=107e308//51e-324~107e308
}
